DROP TABLE IF EXISTS reviews;
CREATE TABLE reviews (
id uuid NOT NULL PRIMARY KEY,
rating  int  CHECK ( rating > 0 AND rating < 6),
comment varchar(500) NOT NULL,
created_at timestamp NOT NULL,
modified_at timestamp NOT NULL,
user_name varchar(40) NOT NULL,
email varchar(100) NOT NULL,
product_sku_code varchar(6) NOT NULL
);

insert into reviews (id, rating, comment, created_at, modified_at, user_name, email, product_sku_code)
values
    
    ('75b9c65f-7c4c-444e-99e1-4c99c06e413c', 4, 'Розкішний і комфортний: Диван Kraken - це справжній символ розкішного відпочинку в моєму будинку. Велюрова оббивка надає йому шикарний вигляд, а м''які подушки забезпечують найвищий рівень комфорту. Я люблю, як він виглядає і як зручно на ньому розташуватися після важкого дня.', '2023-07-15 14:51:14', '2023-07-15 14:51:14', 'Адам', 'customer1@gmail.com', '240011'),
    ('37a1e7ff-dc06-459f-be11-f41e9058d4be', 5, 'Диван Kraken - це справжній шедевр у світі меблів, і я рекомендую його всім, хто цінує якість, комфорт і стиль в одному пакеті.', '2023-05-10 14:51:14', '2023-05-10 14:51:14', 'Ольга', 'customer33@gmail.com', '240011'),
    ('0bb720b5-1554-46dc-95dc-86e71dfff7b5', 5, 'Однією з найкращих особливостей цього дивана є його модульність. Я можу змінювати конфігурацію за власними потребами - розміщувати його як кутовий диван, ліжко або навіть окремі крісла. Ця гнучкість робить його ідеальним для будь-якого простору.', '2023-01-12 14:51:14', '2023-01-12 14:51:14', 'Петро', 'customer34@gmail.com', '240011'),
    ('b3897f78-06b6-4742-8466-a6d0edc463ae', 5, 'Диван Kraken виготовлений з високоякісних матеріалів, і це видно. Він дуже міцний і стійкий до зношування. Моя родина і я використовуємо його щоденно, і він виглядає так само добре, як і в перший день. Я впевнений, що це інвестиція у комфорт і стиль, яка прослужить дуже довго.', '2023-04-20 14:51:14', '2023-04-20 14:51:14', 'Микола', 'customer35@gmail.com', '240011'),

    ('70e70b7a-8b81-488d-a175-e236daf7ea16', 5, 'Цей велюровий диван є справжнім прикладом поєднання стилю і комфорту. Велюрова оббивка додає йому шарму, а металеві ніжки надають йому сучасного вигляду. Підлокітники дозволяють зручно розташуватися, незалежно від того, чи ви читаєте книгу, дивитеся телевізор чи розмовляєте з друзями.', '2023-05-24 14:51:14', '2023-05-24 14:51:14', 'Петро', 'customer34@gmail.com', '240010'),
    ('1dee49b5-ff3d-4940-afda-2b725b27b19a', 4, 'Цей диван - ідеальне місце для відпочинку. Він досить великий, щоб комфортно розташуватися на ньому і відпочивати. Ми також використовуємо його як додаткове місце для гостей, і всі захоплюються його комфортом. Металеві ніжки додають висоти і легкості, що робить його ідеальним вибором для невеликих приміщень.', '2023-03-01 14:51:14', '2023-03-01 14:51:14', 'Ольга', 'customer33@gmail.com', '240010'),
    ('bcb21f47-84ec-4090-b023-98c06c073e4e', 4, 'Моя родина і я користуємося ним кожен день, і він залишається таким самим, як і в перший день.', '2023-08-30 14:51:14', '2023-08-30 14:51:14', 'Давід', 'customer5@gmail.com', '240010'),

    ('ff8e5db0-5513-2135-b06a-2680ff75d066', 5, 'Найкращий вибір для тераси! Стілець Pegas став ідеальним доповненням до нашої тераси. Він легкий, комфортний та дуже стійкий до погодних умов. Його сучасний дизайн і велика кольорова палітра роблять його найкращим вибором для зовнішнього простору.', '2023-06-08 14:51:14', '2023-06-08 14:51:14', 'Адам', 'customer1@gmail.com', '240306'),
    ('ff8e5db0-4167-5288-b06a-2680ff75d066', 5, 'Стілець Pegas дуже зручний для сидіння. Його форма дозволяє тримати спину в комфортному положенні, навіть після тривалого вечора за столом. Крім того, він легкий і легко переміщується, що дуже зручно.', '2023-09-05 14:51:14', '2023-09-05 14:51:14', 'Микола', 'customer1.cozy.home@gmail.com', '240306'),
    ('ff8e5db0-1532-2335-b06a-2680ff75d066', 5, 'Нам подобається сучасний дизайн стільця Pegas. Він гармонійно вписався у наш інтер''єр і став частиною затишного куточка для сімейних обідів і вечірніх розмов. Стілець Pegas відповідає всім нашим очікуванням і ще більше. Ми дуже задоволені цим покупкою і рекомендуємо його всім, хто шукає стильність, зручність і міцність у своєму меблі.', '2023-02-22 14:51:14', '2023-02-22 14:51:14', 'Настя', 'customer3@gmail.com', '240306'),

    ('9cea858c-d78c-4c16-b29e-9542cfd119aa', 5, 'Я дуже вражений зручністю цього стільця. Він має добре продуману форму, що дозволяє сидіти на ньому з комфортом протягом тривалого часу. Поверхня сидіння також досить велика, що робить його ідеальним для спільних обідів і сімейних заходів.', '2023-07-13 14:51:14', '2023-07-13 14:51:14', 'Давід', 'customer5@gmail.com', '240005'),
    ('ff088e00-6782-462a-8565-649ff2dafb3c', 4, 'Стілець Special4You - це справжній символ якості і елегантності. Він додає стилю і затишку до нашої їдальні, і ми вдячні, що обрали саме цей варіант. Я рекомендую його всім, хто цінує якість і стиль в меблях.', '2023-04-28 14:51:14', '2023-04-28 14:51:14', 'Анатолій', 'customer32@gmail.com', '240005'),
    ('0cf82a02-709f-4e31-956b-a2dbd34effd2', 5, 'Він виготовлений з високоякісного натурального дерева, і це видно в кожній деталі. Цей стілець став відмінним доповненням до нашого їдальнього столу, надаючи йому особливий шарм.', '2023-02-08 14:51:14', '2023-02-08 14:51:14', 'Микола', 'customer31@gmail.com', '240005'),

    ('0237a346-48d0-4a41-b490-efd254c5a63b', 5, 'Стілець Wolf - це втілення комфорту та елегантності. Текстильне оббивка додає йому ніжності, і він чудово вписався в наше обіднє приміщення. Ми любимо сидіти на ньому під час сніданків та обідів.', '2023-09-04 14:51:14', '2023-09-04 14:51:14', 'Наталія', 'customer30@gmail.com', '240004'),
    ('3e5657b2-dc18-4253-b5d6-727d8a121606', 5, 'Сидіння на цьому стільці - справжня насолода. Воно м''яке і зручне, і ми можемо проводити за обіднім столом довгі години, не відчуваючи дискомфорту. Металеві ніжки надають стільцю стабільності і міцності.', '2023-08-16 14:51:14', '2023-08-16 14:51:14', 'Вікторія', 'customer29@gmail.com', '240004'),
    ('50f93ba8-2c54-436c-9948-abdf080732df', 5, 'Один з великих плюсів цього стільця - це те, як легко його доглядати. Текстильна оббивка не вимагає особливого догляду і легко чиститься. Це особливо важливо для нашої сім''ї з маленькими дітьми.', '2023-02-18 14:51:14', '2023-02-18 14:51:14', 'Віктор', 'customer28@gmail.com', '240004'),
    ('7ecfef9c-68eb-407f-a419-dd2d9d290e3c', 5, 'Стілець Wolf - це чудовий вибір для нашого їдального простору, і ми насолоджуємося кожною хвилиною, проведеною на ньому. Він поєднує в собі комфорт, якість і стиль, і ми не можемо бути більш задоволені цим вибором. Я рекомендую його всім, хто цінує якість і комфорт у своєму інтер''єрі.', '2023-05-27 14:51:14', '2023-05-27 14:51:14', 'Давід', 'customer5@gmail.com', '240004'),

    ('d290a530-3b03-4787-9653-3a522939e71e', 5, 'Крісло Comfort - це просто неймовірно зручне місце для відпочинку. Велюрова оббивка надає йому неймовірну м''якість, і ви просто погрузитеся в нього, сідаючи. Це моє улюблене місце для читання та перегляду фільмів.', '2023-04-14 14:51:14', '2023-04-14 14:51:14', 'Меланія', 'customer27@gmail.com', '240003'),
    ('a5232da7-5424-4798-9c8b-9280756df1d2', 4, 'Це крісло виглядає неймовірно стильно. Велюр додає йому розкош і сучасний шарм. Якість виготовлення на вищому рівні - від міцної конструкції до точних швів. Воно просто красиве.', '2023-09-05 14:51:14', '2023-09-05 14:51:14', 'Анна', 'customer26@gmail.com', '240003'),
    ('d290a530-3b03-4707-9653-3a522939e71e', 5, 'Я задоволений і ціною, і якістю цього крісла. Воно виглядає і відчувається як дороге крісло, але не обтяжує бюджет. Це гарний вибір для тих, хто шукає комфорт і стиль за розумну ціну.', '2023-08-28 14:51:14', '2023-08-28 14:51:14', 'Антон', 'customer24@gmail.com', '240003'),
    ('a5232da7-5424-4781-9c8b-9280756df1d2', 5, 'Крісло Comfort стало улюбленим місцем для відпочинку в нашому будинку. Це диван, на якому ви просто хочете провести години, насолоджуючись м''якістю та затишком. Я рекомендую його всім, хто цінує комфорт і елегантність у своєму інтер''єрі.', '2023-07-11 14:51:14', '2023-07-11 14:51:14', 'Вікторія', 'customer23@gmail.com', '240003'),

    ('0237a346-48d0-4a82-b490-efd254c5a63b', 4, 'Купили ці крісла півроку тому, досі у захваті. зручне, стильне, нам подобається', '2023-08-30 14:51:14', '2023-08-30 14:51:14', 'Катерина', 'customer22@gmail.com', '240009'),
    ('dc377884-28a3-4ce3-b077-32859f326812', 5, 'Класне крісло, що ідеально вписалося в наш інтер''єр', '2023-09-07 14:51:14', '2023-09-07 14:51:14', 'Анна', 'customer21@gmail.com', '240009'),
    ('3e5657b2-dc18-4514-b5d6-727d8a121606', 4, 'Крісло дуже гарне, батькам виявилося не надто зручне, решті членів сім''ї все подобається', '2023-02-01 14:51:14', '2023-02-01 14:51:14', 'Катерина', 'customer20@gmail.com', '240009'),
    ('50f93ba8-2c54-4045-9948-abdf080732df', 5, 'Кресло очень красивое, стильное и самое главное отличного качества, мы рады что заказали именно у вас и именно эту модель!', '2023-05-30 14:51:14', '2023-05-30 14:51:14', 'Максим', 'customer19@gmail.com', '240009'),
    ('7ecfef9c-68eb-4046-a419-dd2d9d290e3c', 4, 'Кресло Идеально вписалось в наш интерьер. Ткань прекрасно моется, наши дети то шоколад там оставят, то чай прольют, всегда все оттирается!', '2023-05-02 14:51:14', '2023-05-02 14:51:14', 'Давід', 'customer5@gmail.com', '240009'),
    ('b0550865-c6b1-42b7-a5b9-976311449a18', 4, 'Мы очень довольны этими стульями, они удобные, сделаны качественно, добротно, мой муж парень не маленький - 110 кг, это его любимое место после дивана теперь!', '2023-07-25 14:51:14', '2023-07-25 14:51:14', 'Марія', 'customer18@gmail.com', '240009'),
    
    ('dc377884-28a3-4ce3-b077-32459f326812', 4, 'Дивовижне крісло, яке додає шарму та стилю нашому життєвому простору.', '2023-10-07 14:51:14', '2023-10-07 14:51:14', 'Дарья', 'customer17@gmail.com', '240311'),
    ('dc377884-28a3-4ce3-b077-32459f126812', 5, 'Чудовий вибір! Крісло виглядає, ніби створене саме для нас.', '2023-10-30 14:51:14', '2023-10-30 14:51:14', 'Назар', 'customer16@gmail.com', '240311'),
    
    ('dc377884-28a3-4ce3-b077-324509026812', 5, 'Софа Blume - це не тільки предмет меблів, це частина нашого життя.', '2023-10-07 14:51:14', '2023-10-07 14:51:14', 'Софія', 'customer15@gmail.com', '240032'),
    ('dc377884-28a3-4ce3-b077-324509826812', 5, 'Blume - моя улюблена софа усіх часів.', '2023-10-30 14:51:14', '2023-10-30 14:51:14', 'Артем', 'customer14@gmail.com', '240032'),
    
    ('dc370004-28a3-4ce3-b077-324509026812', 4, 'Диван CoolVibe - вражаючий мікс стилю та комфорту!', '2023-10-12 14:51:14', '2023-10-12 14:51:14', 'Вероніка', 'customer13@gmail.com', '240015'),
    ('dc370004-28a3-4ce3-b077-324549026812', 5, 'CoolVibe - це не просто диван, це відчуття емоцій та затишку. Його зручність і вишуканий вигляд роблять нашу вітальню по-справжньому особливою.', '2023-11-15 14:51:14', '2023-11-15 14:51:14', 'Владислав', 'customer12@gmail.com', '240015'),
   
	('dc370234-28a3-4ce3-b077-324509126812', 5, 'Стіл, який став серцем нашого обіднього простору! Його елегантний дизайн і якість виконання роблять кожен прийом їжі справжнім задоволенням.', '2023-11-15 14:51:14', '2023-11-15 14:51:14', 'Поліна', 'customer11@gmail.com', '240022'),
   
	('dc370234-28a3-4ce3-b077-324099026812', 4, 'Цей стіл - ідеальне поєднання стилю та функціональності.', '2023-11-15 14:51:14', '2023-11-15 14:51:14', 'Мілана', 'customer10@gmail.com', '240024'),
   
	('dc370234-28a3-4ce3-b077-324093226812', 4, 'Стіл, який вражає своєю простотою і вишуканістю одночасно.', '2023-10-15 14:51:14', '2023-10-15 14:51:14', 'Тимофій', 'customer9@gmail.com', '240019'),
   
	('dc370234-28a3-4ce3-b066-324091226812', 4, 'Шафа 4Season - ідеальне рішення для нашого простору. Завдяки своєму функціональному дизайну та вмістимості.', '2023-11-11 14:51:14', '2023-11-11 14:51:14', 'Андрій', 'customer8@gmail.com', '240028'),
    ('dc370234-28a3-4ce3-b066-324991226812', 4, '4Season - шафа, яка вражає своєю унікальністю.', '2023-11-11 14:51:14', '2023-11-11 14:51:14', 'Давід', 'customer5@gmail.com', '240028'),
   
	('dc371234-28a3-4ce3-b066-324991226812', 4, 'Комод Jam - втілення стилю та зручності!', '2023-10-11 14:51:14', '2023-10-11 14:51:14', 'Давід', 'customer5@gmail.com', '240035'),
   
	('dc371234-21a3-4ce3-b066-324991226812', 5, 'Ліжко Twin - мрія про комфорт і елегантність в одному. Відмінний вибір для створення атмосфери спокою та стилю у спальні.', '2023-09-11 14:51:14', '2023-09-11 14:51:14', 'Вероніка', 'customer7@gmail.com', '240036'),
    ('dc371234-18a3-4ce3-b066-324991226812', 5, 'Ліжко Twin - ідеальне поєднання зручності та естетики.', '2023-09-11 14:51:14', '2023-09-11 14:51:14', 'Андрій', 'customer6@gmail.com', '240036');
   
    